//信用卡还款实时银行错误码汇总

(function (window) {
    var bankErrorCode = {
        bankErrorCodes:
       [
           {
               //1、兴业银行(3001)错误码
               "BankType": "3001",
               "BankName": "兴业银行",
               "ErrorCodes":
               [
                   ["000000", "交易成功"],
                   ["FE0001", "交易结果不明确"],
                   ["FE0011", "无效交易"],
                   ["FE0012", "请求的功能尚不支持"],
                   ["FE0013", "不允许终端进行的交易"],
                   ["FE0014", "重复交易"],
                   ["FE0015", "发卡方不能操作"],
                   ["FE0016", "系统异常失效"],
                   ["FE0017", "通讯超时"],
                   ["FE0018", "MAC校验错"],
                   ["FE0019", "格式错误"],
                   ["FE0020", "PIN检查错"],
                   ["FE0021", "MD5检查错"],
                   ["FE0022", "数据库操作错"],
                   ["FE0023", "用户名与卡号持有者不匹配"],
                   ["FE0024", "商户信息不存在"],
                   ["FE0025", "商户信息未生效"],
                   ["FE0031", "账号不存在"],
                   ["FE0032", "账户被冻结"],
                   ["FE0033", "卡片已过有效期"],
                   ["FE0034", "没收卡"],
                   ["FE0035", "不允许持卡人进行的交易"],
                   ["FE0036", "无效的交易金额"],
                   ["FE0037", "账户可用余额不足"],
                   ["FE0039", "当月还款次数超限"],
                   ["FE0041", "当日还款次数超限"],
                   ["FE0043", "备付金账户扣款失败"],
                   ["FE0051", "查询无记录"],
                   ["FE0052", "日期格式有误"],
                   ["FE0053", "文件生成错"],
                   ["FE0054", "对账文件尚未生成"],
                   ["000050", "卡号非法"],
                   ["000054", "卡号不存在"],
                   ["000107", "卡号校验位错误"],
                   ["000009", "帐户非法"],
                   ["000014", "未找到此卡号对应的账户记录"],
                   ["FE0099", "其它错误"]
               ]
           }
           //2、宁波银行(3008)错误码
           ,
           {
               "BankType": "3008",
               "BankName": "宁波银行",
               "ErrorCodes":
               [
                   ["0", "交易成功"],
                   ["2", "交易可疑"],
                   ["61", "还款额不足50人民币"],
                   ["0050", "卡号非法"],
                   ["0054", "信用卡号非法"],
                   ["9999", "户名和信用卡号不匹配"],
                   ["1230", "商户账户余额不足"],
                   ["EBPY0005", "订单重复提交"],
                   ["EBPY0018", "商户证书不存在"],
                   ["3403", "非本行卡"],
                   ["09A6", "未收到发卡方应答"]
               ]
           }
           //3、民生银行(3013)错误码
           ,
           {
               "BankType": "3013",
               "BankName": "民生银行",
               "ErrorCodes":
               [
                   ["0000", "交易成功"],
                   ["PAY0000000", "系统异常"],
                   ["PAY0000001", "商户请求数据异常"],
                   ["PAY0000002", "商户不存在或者不可用"],
                   ["PAY0000003", "订单数据不完整或与数据库不一致"],
                   ["PAY0000004", "订单正在处理"],
                   ["PAY0000005", "流水不存在"],
                   ["PAY0000006", "订单已支付成功"],
                   ["PAY0000007", "验证码错误"],
                   ["PAY0000008", "IP地址为黑名单IP"],
                   ["PAY0000009", "MAC地址为黑名单MAC"],
                   ["PAY0000010", "配送地址为黑名单地址"],
                   ["PAY0000011", "卡号为黑名单卡号"],
                   ["PAY0000012", "手机号码为黑单手机"],
                   ["PAY0000013", "支付流水的风险评分过高"],
                   ["PAY0000014", "动态短信口令验证失败"],
                   ["PAY0000015", "通讯超时"],
                   ["PAY0000016", "订单重复"],
                   ["PAY0000017", "商户不允许做一般交易"],
                   ["PAY0000020", "商户秘钥不可用"],
                   ["PAY0000021", "分期商品编号未设置"],
                   ["PAY0000024", "超过单笔支付限额"],
                   ["PAY0000025", "超过日累计支付限额"],
                   ["PAY1000008", "可退金额不足"],
                   ["PAY1000009", "内部账户金额不足"],
                   ["PAY1000010", "订单支付失败"],
                   ["PAY1000011", "订单不存在"],
                   ["PAY1000012", "订单可退金额为0"],
                   ["PAY1000013", "订单已撤销"],
                   ["PAY1000014", "历史订单，不能撤销"],
                   ["PAY1000015", "订单退货错误，当日订单"],
                   ["PAY1000016", "订单撤销出错，只能撤销当日订单"],
                   ["PAY1000018", "商户不允许做分期交易"],
                   ["PAY1000020", "撤销交易处理中"],
                   ["PAY1000021", "撤销交易状态不确定"],
                   ["PAY1000022", "退货交易处理中"],
                   ["PAY1000023", "有退货交易状态不确定"],
                   ["PAY1000024", "有退货交易成功"],
                   ["PAY1000025", "找不到原流水"]
               ]
           }
           //4、平安银行(3014)错误码
           ,
           {
               "BankType": "3014",
               "BankName": "平安银行",
               "ErrorCodes":
               [
                   ["00", "交易成功"],
                   ["01", "查发卡机构"],
                   ["02", "查发卡机构的特殊条件"],
                   ["03", "无效商户"],
                   ["04", "没收卡"],
                   ["05", "不予承兑"],
                   ["06", "出错"],
                   ["07", "特殊条件下没收卡"],
                   ["09", "请求正在处理中"],
                   ["12", "无效交易"],
                   ["13", "无效金额"],
                   ["14", "无效卡号"],
                   ["15", "无此发卡机构"],
                   ["19", "重新送入交易"],
                   ["20", "无效应答"],
                   ["21", "不做任何处理"],
                   ["22", "怀疑操作有误"],
                   ["23", "不可接受的交易费"],
                   ["25", "未能找到文件上记录"],
                   ["30", "格式错误"],
                   ["31", "银联不支持的银机构"],
                   ["33", "过期的卡"],
                   ["34", "有作弊嫌疑"],
                   ["35", "受卡方与安全保密部门联系"],
                   ["36", "受限制的卡"],
                   ["37", "受卡方呼受理方安全保密部门(没收卡)"],
                   ["38", "超过允许的PIN试输入"],
                   ["39", "无此信用卡账户"],
                   ["40", "请求的功能尚不支持"],
                   ["41", "丢失卡"],
                   ["42", "无此账户"],
                   ["43", "被窃卡"],
                   ["44", "无此投资账户"],
                   ["51", "无足够的存款"],
                   ["52", "无此支票账户"],
                   ["53", "无此储蓄卡账户"],
                   ["54", "过期的卡"],
                   ["55", "不正确的PIN"],
                   ["56", "无此卡记录"],
                   ["57", "不允许持卡人进机构的交易"],
                   ["58", "不允许终端进机构的交易"],
                   ["59", "有作弊嫌疑"],
                   ["60", "受卡方与安全保密部门联系"],
                   ["61", "超出取款金额限制"],
                   ["62", "受限制的卡"],
                   ["63", "违反安全保密规定"],
                   ["64", "原始金额不正确"],
                   ["65", "超出取款次数限制"],
                   ["66", "受卡方呼受理方安全保密部门"],
                   ["67", "捕捉（没收卡）"],
                   ["68", "收到的回答太迟"],
                   ["75", "允许的输入PIN次数超限"],
                   ["77", "需要向网络中心签到"],
                   ["79", "脱机交易对账不平"],
                   ["90", "日期切换正在处理"],
                   ["91", "发卡机构或银联不能操作"],
                   ["92", "金融机构或中间网络设施找不到或无法达到"],
                   ["93", "交易违法、不能完成"],
                   ["94", "重复交易"],
                   ["95", "调节控制错"],
                   ["96", "系统异常、失效"],
                   ["97", "终端号找不到"],
                   ["98", "银联收不到发卡机构应答"],
                   ["99", "PIN格式错"],
                   ["A0", "MAC校验错"]
               ]
           }
           //5、中信银行(3015)错误码
           ,
           {
               "BankType": "3015",
               "BankName": "中信银行",
               "ErrorCodes":
               [
                   ["0301500000", "交易成功"],
                   ["0301500003", "卡号错误"],
                   ["00007", ""],
                   ["00022", ""],
                   ["03015000N2", "户名错误"]
               ]
           }
           //6、光大银行(3021)错误码
           ,
           {
               "BankType": "3021",
               "BankName": "光大银行",
               "ErrorCodes":
               [
                   ["AAAAAAA", "交易成功"],
                   ["BBBBBBB", "交易超时，总前未响应"],
                   ["ECM0000", "数据库操作异常"],
                   ["ECM0001", "查询记录不存在"],
                   ["ECM0003", "当日尝试校验次数超过上限"],
                   ["ECM0004", "卡号与姓名不符"],
                   ["ECM0006", "该卡当月还款次数已达上限"],
                   ["ECM0007", "商户已停用"],
                   ["ECM0008", "系统内部流程异常"],
                   ["ECM0009", "与总前交易异常"],
                   ["ECM0010", "上送流水号重复"],
                   ["ECM0011", "卡号不存在"],
                   ["ECM0012", "该时段不允许交易"],
                   ["EGG0009", "卡不存在"],
                   ["EGG0033", "超过限定"],
                   ["EGG0044", "帐户余额不足"],
                   ["EGG1037", "账号不是贷记卡"],
                   ["ETF9003", "通讯异常"],
                   ["SOP0903", "MAC校验失败"]
               ]
           }
           //7、浦发银行(3023)错误码
           ,
           {
               "BankType": "3023",
               "BankName": "浦发银行",
               "ErrorCodes":
               [
                   ["AAAAAAA", "交易成功"],
                   ["IA00202", "非法操作，请先核身"],
                   ["IA00203", "非法操作，请先发送动态密码"],
                   ["IA00204", "非法操作，请先签约"],
                   ["IA00205", "非法操作，请先解约"],
                   ["IA00206", "分期交易信息不全"],
                   ["000050", "卡号非法"],
                   ["009231", "姓名不符"],
                   ["IA10065", "对不起，该机构无权限执行此交易"],
                   ["WG00091", "流水表插入错误"],
                   ["IA10053", "不符合要求格式"],
                   ["WG00000", "重复交易"],
                   ["SYS0000", "系统内部错误"],
                   ["010098", "帐户BLOCKCODE被禁止还款"]
               ]
           }
           //8、农业银行(3024)错误码
           ,
           {
               "BankType": "3024",
               "BankName": "农业银行",
               "ErrorCodes":
               [
                   ["00", "交易成功"],
                   ["01", "查发卡行"],
                   ["02", "查发卡行的特殊条件"],
                   ["03", "无效商户"],
                   ["04", "没收卡"],
                   ["05", "不予承兑"],
                   ["06", "交易已冲正"],
                   ["07", "特殊条件下没收卡"],
                   ["09", "请求正在处理中"],
                   ["12", "无效交易"],
                   ["13", "无效金额"],
                   ["14", "无效卡号"],
                   ["15", "无此发卡行"],
                   ["16", "金额超出限制"],
                   ["17", "未签约账户"],
                   ["19", "重新送入交易"],
                   ["20", "无效应答"],
                   ["21", "不做任何处理"],
                   ["22", "怀疑操作有误"],
                   ["23", "不可接受的交易费"],
                   ["25", "记录不存在"],
                   ["30", "磁条校验错或格式错误"],
                   ["31", "银联不支持的银行"],
                   ["33", "过期的卡"],
                   ["34", "有作弊嫌疑"],
                   ["35", "受卡方与安全保密部门联系"],
                   ["36", "受限制的卡"],
                   ["37", "受卡方呼受理方安全保密部门(没收卡)"],
                   ["38", "超过允许的PIN试输入"],
                   ["39", "无此信用卡账户"],
                   ["40", "请求的功能尚不支持"],
                   ["41", "账户状态异常卡，或不支持该业务"],
                   ["42", "卡号不合法或不存在"],
                   ["43", "被窃卡"],
                   ["44", "无此投资账户"],
                   ["51", "余额不足或透支超"],
                   ["52", "无此支票账户"],
                   ["53", "无此储蓄卡账户"],
                   ["54", "过期的卡"],
                   ["55", "账号密码错"],
                   ["56", "无此卡记录"],
                   ["57", "不允许持卡人进行的交易"],
                   ["58", "不允许终端进行的交易"],
                   ["59", "有作弊嫌疑"],
                   ["60", "受卡方与安全保密部门联系"],
                   ["61", "超出取款金额限制"],
                   ["62", "受限制的卡"],
                   ["63", "违反安全保密规定"],
                   ["64", "原始金额不正确"],
                   ["65", "超出取款次数限制"],
                   ["66", "受卡方呼受理方安全保密部门"],
                   ["67", "捕捉（没收卡）"],
                   ["68", "收到的回答太迟"],
                   ["75", "允许的输入密码次数超限"],
                   ["77", "需要向网络中心签到"],
                   ["79", "脱机交易对账不平"],
                   ["80", "交易拒绝"],
                   ["87", "手机号不符"],
                   ["90", "日期切换正在处理"],
                   ["91", "发卡行或银联不能操作"],
                   ["92", "金融机构或中间网络设施找不到或无法达到"],
                   ["93", "交易违法、不能完成"],
                   ["94", "重复交易"],
                   ["95", "调节控制错"],
                   ["96", "系统错误"],
                   ["97", "终端号错"],
                   ["98", "银联收不到发卡行应答"],
                   ["99", "PIN格式错"],
                   ["A0", "MAC校验错"],
                   ["A1", "未签到"],
                   ["A2", "户名不符"],
                   ["A3", "交易异常"],
                   ["A4", "已异常处理"],
                   ["A5", "冲正异常"],
                   ["A6", "交易已撤销"],
                   ["A7", "客户证件类型或证件号码不符"],
                   ["A8", "未签约手机银行"],
                   ["AA", "未知错误码"],
                   ["MM", "系统暂停服务"]
               ]
           }
       ],
        fn: {}
    };

    bankErrorCode.fn.getBank = function (backType) {
        var banks = bankErrorCode.bankErrorCodes;
        for (var i = 0; i < banks.length; i++) {
            var bankinfo = banks[i];
            if (bankinfo.BankType == backType) {
                return bankinfo;
            }
        }
        return null;
    };

    bankErrorCode.getBankErrorCode = function (backType, errCode) {
        var bankinfo = bankErrorCode.fn.getBank(backType);
        if (bankinfo != null) {
            for (var j = 0; j < bankinfo.ErrorCodes.length; j++) {
                var err = bankinfo.ErrorCodes[j];
                if (err[0] == errCode) {
                    return err[1];
                }
            }
        }
        return errCode;
    }

    bankErrorCode.getBankName = function (backType) {
        var bankinfo = bankErrorCode.fn.getBank(backType);
        if (bankinfo != null) {
            return bankinfo.BankName;
        }
        return backType;
    }

    window.bankErrorCode = bankErrorCode;
})(window)
